Org/RStoolbox_0.01_(2014-5-6_by_).html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>RStoolbox_0.01_(2014-5-6_by_)</title>
<!-- 2014-09-15 Mon 16:35 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="tian" />
</head>
<body>
<div id="content">
<h1 class="title">RStoolbox_0.01_(2014-5-6_by_)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. cloudMask.R</a></li>
<li><a href="#sec-2">2. estimateSHV.R</a></li>
<li><a href="#sec-3">3. internalFunctions.R</a></li>
<li><a href="#sec-4">4. radCor.R</a></li>
<li><a href="#sec-5">5. readMeta.R</a></li>
<li><a href="#sec-6">6. RStoolbox.R</a></li>
<li><a href="#sec-7">7. spectralIndices.R</a></li>
<li><a href="#sec-8">8. superClass.R</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li>Package: RStoolbox
</li>
<li>Type: Package
</li>
<li>Title: RStoolbox: A Collection of Remote Sensing Tools
</li>
<li>Version: 0.01
</li>
<li>Date: 2014-5-6
</li>
<li>Authors@R: c( person(&ldquo;Benjamin&rdquo;, &ldquo;Leutner&rdquo;, role = c(&ldquo;cre&rdquo;, &ldquo;aut&rdquo;), email =
</li>
<li>&ldquo;benjamin.leutner@uni-wuerzburg.de&rdquo;), person(&ldquo;Ned&rdquo;, &ldquo;Horning&rdquo;, role =
</li>
<li>c(&ldquo;aut&rdquo;), email = &ldquo;horning@amnh.org&rdquo;), person(&ldquo;Martin&rdquo;, &ldquo;Wegmann&rdquo;, role =
</li>
<li>c(&ldquo;aut&rdquo;), email = &ldquo;martin.wegmann@uni-wuerzburg.de&rdquo;))
</li>
<li>Description: RStoolbox provides remote sensing methods for image processing and
</li>
<li>classification such as spectral indices, supervised classification or
</li>
<li>fractional cover.
</li>
<li>Depends:
</li>
<li>R (&gt;= 3.1.0)
</li>
<li>Imports:
</li>
<li>stringr,
</li>
<li>raster,
</li>
<li>randomForest
</li>
<li>License: GPL (&gt;=3)
</li>
<li>LazyData: true
</li>
</ul>
