Org/RStoolbox_0.01_(2014-5-6_by_).org
* cloudMask.R
#+BEGIN_SRC R 
cloudMask <- function(x, threshold, minCloudSize, windowSize1 = 5, windowSize2 = 11, maskGrowing = TRUE, sanitize = TRUE, lowBand = B1, tirBand = B6, plot = TRUE, verbose = TRUE, returnDiffLayer = FALSE){
	
	
	op <- par(mfrow = c(2, 1 + sum(sanitize, maskGrowing)))
	
	
	if(CDIFF %in% names(x)) {
		if(verbose) message(Re-using CDIFF layer from previous run.)
		cdiff <- x[[CDIFF]]
	} else {
		cdiff <- x[[lowBand]] - x[[tirBand]]
		names(cdiff) <- CDIFF
	}
	
	
	if(missing(threshold)) {
		threshold <- quantile(cdiff@data@max:cdiff@data@min, 0.45)
		if(verbose) {message(paste0(Estimated cloud threshold should be between , round(cdiff@data@min),  and , round(cdiff@data@max)) )
			message(paste0(Guessed threshold (rounded): , round(threshold)))
		}
	}
	if(threshold < cdiff@data@min | threshold > cdiff@data@max) warning(Threshold is not within the estimated data range, call. = FALSE)
	
	if(plot) plot(cdiff, main = Cloud layer: blue - tir difference)
	
	
	if(verbose) message(Begin thresholding)
	cmask <- cdiff > threshold
	cmask <- mask(cmask, cmask, maskvalue = 0)
	
	if(plot) plot(cmask, main = paste0(Cloud mask\nThreshold: , threshold))
	
	
	
	if(sanitize) {
		if(verbose) message(Begin sanitzing)
		if(missing(minCloudSize)) minCloudSize <- windowSize1 ^ 2
		w <- matrix(ncol = windowSize1, nrow = windowSize1, 1)
		if(minCloudSize >= windowSize^2) {
			cmod <- focal(cmask, w, na.rm = FALSE)
		} else {
			cmod <- focal(cmask, w, na.rm = TRUE)	
			cmod[cmod < minCloudSize] <- NA		
		}
		cmod[cmod < minCloudSize] <- NA
		cmod[!is.na(cmod)] <- 1L
		if(plot) plot(cmod, main = Sanitized cloud mask)
		
	}
	
	
	if(maskGrowing){
		if(verbose) message(Begin region-growing)
		w <- matrix(ncol = windowSize2, nrow = windowSize2, 1)
		cmod <- focal(cmod, w, na.rm = TRUE )
		cmod[!is.na(cmod)] <- 1L
		if(plot) plot(cmod, main = Region-grown cloud mask)
		
	}
	
	if(plot){
		plotRGB(x, 1, 2, 3, title = Final mask, stretch = lin)
		plot(cmod,  legend = FALSE, add = T, col = yellow)
	}
	
	
	par(op)
	
	
	names(cmod) <- CMASK
	if(returnDiffLayer) cmod <- stack(cmod, cdiff)
	return(cmod)	
}
#+END_SRC
