Org/RStoolbox_0.01_(2014-5-6_by_).html
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> cloudMask.R</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">cloudMask</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>x, threshold, minCloudSize, windowSize<span style="color: #daa520;">1</span> <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">5</span>, windowSize<span style="color: #daa520;">2</span> <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">11</span>, maskGrowing <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span>, sanitize <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span>, lowBand <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">1</span>, tirBand <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">6</span>, plot <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span>, verbose <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span>, returnDiffLayer <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">){</span>


        op <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">par</span><span style="color: #20b2aa;">(</span>mfrow <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">2</span>, <span style="color: #daa520;">1</span> <span style="color: #ff00ff;">+</span> <span style="color: #ff6347;">sum</span><span style="color: #20b2aa;">(</span>sanitize, maskGrowing<span style="color: #20b2aa;">)))</span>


        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>CDIFF <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>verbose<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span>Re<span style="color: #ff00ff;">-</span>using CDIFF layer from previous run.<span style="color: #20b2aa;">)</span>
                cdiff <span style="color: #ff00ff;">&lt;-</span> x<span style="color: #20b2aa;">[[</span>CDIFF<span style="color: #20b2aa;">]]</span>
        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                cdiff <span style="color: #ff00ff;">&lt;-</span> x<span style="color: #20b2aa;">[[</span>lowBand<span style="color: #20b2aa;">]]</span> <span style="color: #ff00ff;">-</span> x<span style="color: #20b2aa;">[[</span>tirBand<span style="color: #20b2aa;">]]</span>
                <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>cdiff<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&lt;-</span> CDIFF
        <span style="color: #20b2aa;">}</span>


        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>threshold<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                threshold <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">quantile</span><span style="color: #20b2aa;">(</span>cdiff@data@max:cdiff@data@min, <span style="color: #daa520;">0</span>.<span style="color: #daa520;">45</span><span style="color: #20b2aa;">)</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>verbose<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span><span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>Estimated cloud threshold should be between , <span style="color: #ff6347;">round</span><span style="color: #20b2aa;">(</span>cdiff@data@min<span style="color: #20b2aa;">)</span>,  and , <span style="color: #ff6347;">round</span><span style="color: #20b2aa;">(</span>cdiff@data@max<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">)</span>
                        <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>Guessed <span style="color: #ff6347;">threshold</span> <span style="color: #20b2aa;">(</span>rounded<span style="color: #20b2aa;">)</span>: , <span style="color: #ff6347;">round</span><span style="color: #20b2aa;">(</span>threshold<span style="color: #20b2aa;">)))</span>
                <span style="color: #20b2aa;">}</span>
        <span style="color: #20b2aa;">}</span>
        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>threshold <span style="color: #ff00ff;">&lt;</span> cdiff@data@min | threshold <span style="color: #ff00ff;">&gt;</span> cdiff@data@max<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">warning</span><span style="color: #20b2aa;">(</span>Threshold is not within the estimated data range, call. <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>plot<span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">plot</span><span style="color: #20b2aa;">(</span>cdiff, main <span style="color: #ff00ff;">=</span> Cloud layer: blue <span style="color: #ff00ff;">-</span> tir difference<span style="color: #20b2aa;">)</span>


        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>verbose<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span>Begin thresholding<span style="color: #20b2aa;">)</span>
        cmask <span style="color: #ff00ff;">&lt;-</span> cdiff <span style="color: #ff00ff;">&gt;</span> threshold
        cmask <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">mask</span><span style="color: #20b2aa;">(</span>cmask, cmask, maskvalue <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">0</span><span style="color: #20b2aa;">)</span>

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>plot<span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">plot</span><span style="color: #20b2aa;">(</span>cmask, main <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>Cloud mask\nThreshold: , threshold<span style="color: #20b2aa;">))</span>



        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>sanitize<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>verbose<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span>Begin sanitzing<span style="color: #20b2aa;">)</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>minCloudSize<span style="color: #20b2aa;">))</span> minCloudSize <span style="color: #ff00ff;">&lt;-</span> windowSize<span style="color: #daa520;">1</span> ^ <span style="color: #daa520;">2</span>
                w <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">matrix</span><span style="color: #20b2aa;">(</span>ncol <span style="color: #ff00ff;">=</span> windowSize<span style="color: #daa520;">1</span>, nrow <span style="color: #ff00ff;">=</span> windowSize<span style="color: #daa520;">1</span>, <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>minCloudSize <span style="color: #ff00ff;">&gt;=</span> windowSize^<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                        cmod <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">focal</span><span style="color: #20b2aa;">(</span>cmask, w, na.rm <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>
                <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                        cmod <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">focal</span><span style="color: #20b2aa;">(</span>cmask, w, na.rm <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">)</span>   
                        cmod<span style="color: #20b2aa;">[</span>cmod <span style="color: #ff00ff;">&lt;</span> minCloudSize<span style="color: #20b2aa;">]</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">NA</span>         
                <span style="color: #20b2aa;">}</span>
                cmod<span style="color: #20b2aa;">[</span>cmod <span style="color: #ff00ff;">&lt;</span> minCloudSize<span style="color: #20b2aa;">]</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">NA</span>
                cmod<span style="color: #20b2aa;">[</span>!<span style="color: #ff6347;">is.na</span><span style="color: #20b2aa;">(</span>cmod<span style="color: #20b2aa;">)]</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">1</span>L
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>plot<span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">plot</span><span style="color: #20b2aa;">(</span>cmod, main <span style="color: #ff00ff;">=</span> Sanitized cloud mask<span style="color: #20b2aa;">)</span>

        <span style="color: #20b2aa;">}</span>


        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>maskGrowing<span style="color: #20b2aa;">){</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>verbose<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span>Begin region<span style="color: #ff00ff;">-</span>growing<span style="color: #20b2aa;">)</span>
                w <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">matrix</span><span style="color: #20b2aa;">(</span>ncol <span style="color: #ff00ff;">=</span> windowSize<span style="color: #daa520;">2</span>, nrow <span style="color: #ff00ff;">=</span> windowSize<span style="color: #daa520;">2</span>, <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>
                cmod <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">focal</span><span style="color: #20b2aa;">(</span>cmod, w, na.rm <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span> <span style="color: #20b2aa;">)</span>
                cmod<span style="color: #20b2aa;">[</span>!<span style="color: #ff6347;">is.na</span><span style="color: #20b2aa;">(</span>cmod<span style="color: #20b2aa;">)]</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">1</span>L
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>plot<span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">plot</span><span style="color: #20b2aa;">(</span>cmod, main <span style="color: #ff00ff;">=</span> Region<span style="color: #ff00ff;">-</span>grown cloud mask<span style="color: #20b2aa;">)</span>

        <span style="color: #20b2aa;">}</span>

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>plot<span style="color: #20b2aa;">){</span>
                <span style="color: #ff6347;">plotRGB</span><span style="color: #20b2aa;">(</span>x, <span style="color: #daa520;">1</span>, <span style="color: #daa520;">2</span>, <span style="color: #daa520;">3</span>, title <span style="color: #ff00ff;">=</span> Final mask, stretch <span style="color: #ff00ff;">=</span> lin<span style="color: #20b2aa;">)</span>
                <span style="color: #ff6347;">plot</span><span style="color: #20b2aa;">(</span>cmod,  legend <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span>, add <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">T</span>, col <span style="color: #ff00ff;">=</span> yellow<span style="color: #20b2aa;">)</span>
        <span style="color: #20b2aa;">}</span>


        <span style="color: #ff6347;">par</span><span style="color: #20b2aa;">(</span>op<span style="color: #20b2aa;">)</span>


        <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>cmod<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&lt;-</span> CMASK
        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>returnDiffLayer<span style="color: #20b2aa;">)</span> cmod <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">stack</span><span style="color: #20b2aa;">(</span>cmod, cdiff<span style="color: #20b2aa;">)</span>
        <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span>cmod<span style="color: #20b2aa;">)</span>    
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
