Org/RStoolbox_0.01_(2014-5-6_by_).html
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> estimateSHV.R</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">estimateSHV</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>x, hazeBand, darkProp <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">02</span>, plot <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span>, returnTables <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>


        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">inherits</span><span style="color: #20b2aa;">(</span>x, Raster<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                preCalc <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">FALSE</span>
        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.list</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span> &amp; table <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                        preCalc <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">TRUE</span> 
                <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                        <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span>x must be a Raster* object or the result of a previous run of <span style="color: #ff6347;">estimateSHV</span><span style="color: #20b2aa;">(</span>Raster*, <span style="color: #20b2aa;">)</span> with argument <span style="color: #00ff00;">'returnTables = TRUE'</span>, call. <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>
                <span style="color: #20b2aa;">}</span>       
        <span style="color: #20b2aa;">}</span>

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>!preCalc<span style="color: #20b2aa;">){</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>hazeBand<span style="color: #20b2aa;">)){</span> 
                        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">nlayers</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">==</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                                hazeBand <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span>        
                        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                                <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span>Please specify the band from which you want to estimate the haze dn<span style="color: #20b2aa;">)</span>
                        <span style="color: #20b2aa;">}</span>       
                        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.numeric</span><span style="color: #20b2aa;">(</span>hazeBand<span style="color: #20b2aa;">))</span> hazeBand <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)[</span>hazeBand<span style="color: #20b2aa;">]</span>
                <span style="color: #20b2aa;">}</span>

        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>

                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.numeric</span><span style="color: #20b2aa;">(</span>hazeBand<span style="color: #20b2aa;">))</span> hazeBand <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x$table<span style="color: #20b2aa;">)[</span>hazeBand<span style="color: #20b2aa;">]</span>
                preCalcAvail <span style="color: #ff00ff;">&lt;-</span> hazeBand <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x$table<span style="color: #20b2aa;">)</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>!<span style="color: #ff6347;">any</span><span style="color: #20b2aa;">(</span>preCalcAvail<span style="color: #20b2aa;">))</span>  <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span>Cannot estimate SHV because tables are missing <span style="color: #00ffff;">for</span> all specified bands, call. <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>

                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">any</span><span style="color: #20b2aa;">(</span>!preCalcAvail<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                        <span style="color: #00ffff;">warning</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>Cannot estimate SHV <span style="color: #00ffff;">for</span> <span style="color: #ff00ff;">&gt;&gt;</span> , hazeBand<span style="color: #20b2aa;">[</span>!preCalcAvail<span style="color: #20b2aa;">]</span>,  <span style="color: #ff00ff;">&lt;&lt;</span> because tables are missing.<span style="color: #20b2aa;">)</span>, call. <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>
                        hazeBand <span style="color: #ff00ff;">&lt;-</span> hazeBand<span style="color: #20b2aa;">[</span>preCalcAvail<span style="color: #20b2aa;">]</span>                              
                <span style="color: #20b2aa;">}</span>       
        <span style="color: #20b2aa;">}</span>


        multiple <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">length</span><span style="color: #20b2aa;">(</span>hazeBand<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&gt;</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> <span style="color: #daa520;">TRUE</span> <span style="color: #00ffff;">else</span> <span style="color: #daa520;">FALSE</span>


        out   <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">lapply</span><span style="color: #20b2aa;">(</span>hazeBand, <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>bi<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">inherits</span><span style="color: #20b2aa;">(</span>x, Raster<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                                        tf <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">freq</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">[[</span>bi<span style="color: #20b2aa;">]]</span>, useNA <span style="color: #ff00ff;">=</span> no<span style="color: #20b2aa;">)</span> 
                                <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                                        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.list</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span> &amp; table <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                                                preCalc <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">TRUE</span>
                                                tf <span style="color: #ff00ff;">&lt;-</span> x$table<span style="color: #20b2aa;">[[</span>bi<span style="color: #20b2aa;">]]</span>
                                        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                                                <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span>x must be a Raster* object or the result of a previous run of <span style="color: #ff6347;">estimateSHV</span><span style="color: #20b2aa;">()</span> with argument <span style="color: #00ff00;">'returnTables = TRUE'</span>, call. <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>
                                        <span style="color: #20b2aa;">}</span>
                                <span style="color: #20b2aa;">}</span>
                                tf <span style="color: #ff00ff;">&lt;-</span> tf<span style="color: #20b2aa;">[</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span> <span style="color: #ff00ff;">&gt;</span> <span style="color: #daa520;">0</span>,<span style="color: #20b2aa;">]</span>
                                tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">2</span><span style="color: #20b2aa;">]</span> <span style="color: #ff00ff;">&lt;-</span> tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">2</span><span style="color: #20b2aa;">]</span><span style="color: #ff00ff;">/</span><span style="color: #ff6347;">sum</span><span style="color: #20b2aa;">(</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">2</span><span style="color: #20b2aa;">])</span>
                                dtf <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">diff</span><span style="color: #20b2aa;">(</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">2</span><span style="color: #20b2aa;">])</span>,<span style="color: #daa520;">0</span><span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">/</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">diff</span><span style="color: #20b2aa;">(</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">])</span>,<span style="color: #daa520;">0</span><span style="color: #20b2aa;">)</span>

                                SHV <span style="color: #ff00ff;">&lt;-</span> tf<span style="color: #20b2aa;">[</span><span style="color: #ff6347;">which</span><span style="color: #20b2aa;">(</span>dtf <span style="color: #ff00ff;">&gt;</span> darkProp<span style="color: #20b2aa;">)[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span>, <span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span> 
                                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.na</span><span style="color: #20b2aa;">(</span>SHV<span style="color: #20b2aa;">))</span> <span style="color: #00ffff;">warning</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span>darkProp <span style="color: #00ffff;">for</span> band, bi, was chosen too high. It exceeds the value range.<span style="color: #20b2aa;">)</span>, call. <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>

                                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>plot<span style="color: #20b2aa;">){</span>
                                        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>multiple<span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">x</span><span style="color: #daa520;">11</span><span style="color: #20b2aa;">()</span>
                                        <span style="color: #ff6347;">par</span><span style="color: #20b2aa;">(</span>mfrow <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">1</span>,<span style="color: #daa520;">2</span><span style="color: #20b2aa;">))</span>

                                        <span style="color: #ff6347;">plot</span><span style="color: #20b2aa;">(</span>tf, xlab <span style="color: #ff00ff;">=</span> DN, ylab <span style="color: #ff00ff;">=</span> Frequency, type <span style="color: #ff00ff;">=</span> l, main <span style="color: #ff00ff;">=</span> bi<span style="color: #20b2aa;">)</span>
                                        <span style="color: #ff6347;">abline</span><span style="color: #20b2aa;">(</span>v <span style="color: #ff00ff;">=</span> tf<span style="color: #20b2aa;">[</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span><span style="color: #ff00ff;">==</span>SHV,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span>, col<span style="color: #ff00ff;">=</span>red<span style="color: #20b2aa;">)</span>
                                        <span style="color: #ff6347;">text</span><span style="color: #20b2aa;">(</span>SHV, <span style="color: #ff6347;">max</span><span style="color: #20b2aa;">(</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">2</span><span style="color: #20b2aa;">])</span>, pos<span style="color: #ff00ff;">=</span><span style="color: #daa520;">4</span>, label <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>SHV_DN <span style="color: #ff00ff;">=</span> , SHV<span style="color: #20b2aa;">)</span>, col <span style="color: #ff00ff;">=</span>red<span style="color: #20b2aa;">)</span>

                                        <span style="color: #ff6347;">plot</span><span style="color: #20b2aa;">(</span>dtf, type<span style="color: #ff00ff;">=</span>l, xlab <span style="color: #ff00ff;">=</span> DN, ylab <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">diff</span><span style="color: #20b2aa;">(</span>Frequency<span style="color: #20b2aa;">)</span>, main <span style="color: #ff00ff;">=</span> bi<span style="color: #20b2aa;">)</span>
                                        <span style="color: #ff6347;">abline</span><span style="color: #20b2aa;">(</span>v <span style="color: #ff00ff;">=</span> tf<span style="color: #20b2aa;">[</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span><span style="color: #ff00ff;">==</span>SHV,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span>, col<span style="color: #ff00ff;">=</span>red<span style="color: #20b2aa;">)</span>
                                        <span style="color: #ff6347;">abline</span><span style="color: #20b2aa;">(</span>h <span style="color: #ff00ff;">=</span> darkProp, col <span style="color: #ff00ff;">=</span> <span style="color: #cccccc;">#</span><span style="color: #daa520;">00000070</span><span style="color: #cccccc;">, lty = </span><span style="color: #daa520;">2</span><span style="color: #cccccc;">)</span>
                                        <span style="color: #ff6347;">text</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">max</span><span style="color: #20b2aa;">(</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">])</span>, darkProp, label <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>darkProp <span style="color: #ff00ff;">=</span> , darkProp<span style="color: #20b2aa;">)</span>, col <span style="color: #ff00ff;">=</span> <span style="color: #cccccc;">#</span><span style="color: #daa520;">00000070</span><span style="color: #cccccc;">)</span>
                                        <span style="color: #ff6347;">text</span><span style="color: #20b2aa;">(</span>SHV, <span style="color: #ff6347;">max</span><span style="color: #20b2aa;">(</span>dtf, na.rm <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">)</span>, pos<span style="color: #ff00ff;">=</span><span style="color: #daa520;">4</span>, label <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>SHV_DN <span style="color: #ff00ff;">=</span> , SHV<span style="color: #20b2aa;">)</span>, col <span style="color: #ff00ff;">=</span>red<span style="color: #20b2aa;">)</span>

                                <span style="color: #20b2aa;">}</span>

                                <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>table <span style="color: #ff00ff;">=</span> tf, SHV <span style="color: #ff00ff;">=</span> SHV<span style="color: #20b2aa;">))</span>
                        <span style="color: #20b2aa;">})</span>

        SHV <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">unlist</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span>out, <span style="color: #20b2aa;">[</span>, <span style="color: #daa520;">2</span><span style="color: #20b2aa;">))</span>
        <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>SHV<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&lt;-</span> hazeBand

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>!preCalc<span style="color: #20b2aa;">){</span>
                table <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span>out, <span style="color: #20b2aa;">[</span>, <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>
                <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>table<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&lt;-</span> hazeBand
        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                table <span style="color: #ff00ff;">&lt;-</span> x$table
        <span style="color: #20b2aa;">}</span>
        <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span> <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>!returnTables<span style="color: #20b2aa;">)</span> SHV <span style="color: #00ffff;">else</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>SHV<span style="color: #ff00ff;">=</span>SHV, table <span style="color: #ff00ff;">=</span> table<span style="color: #20b2aa;">))</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
