Org/RStoolbox_0.01_(2014-5-6_by_).org
* internalFunctions.R
#+BEGIN_SRC R 
.ESdist <- function(adate){	
	edist <- julian(as.Date(adate), origin=as.Date(paste(substring(adate, 1, 4), 12, 31, sep=-)))[[1]]
	 1 - 0.016729 * cos((2*pi) * (0.9856 * (edist - 4)/360))
}
.getNumeric <- function(x, returnNumeric = TRUE) {
	sapply(x, function(xi){
				d <- strsplit(xi, [^[:digit:]])[[1]]
				d <- if(returnNumeric) as.numeric(d[d!=]) else d[d!=]
				d
			})
}
#+END_SRC
