Org/RStoolbox_0.01_(2014-5-6_by_).html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> internalFunctions.R</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">.ESdist</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>adate<span style="color: #20b2aa;">){</span>     
        edist <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">julian</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">as.Date</span><span style="color: #20b2aa;">(</span>adate<span style="color: #20b2aa;">)</span>, origin<span style="color: #ff00ff;">=</span><span style="color: #ff6347;">as.Date</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">substring</span><span style="color: #20b2aa;">(</span>adate, <span style="color: #daa520;">1</span>, <span style="color: #daa520;">4</span><span style="color: #20b2aa;">)</span>, <span style="color: #daa520;">12</span>, <span style="color: #daa520;">31</span>, sep<span style="color: #ff00ff;">=-</span><span style="color: #20b2aa;">)))[[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]]</span>
         <span style="color: #daa520;">1</span> <span style="color: #ff00ff;">-</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">016729</span> * <span style="color: #ff6347;">cos</span><span style="color: #20b2aa;">((</span><span style="color: #daa520;">2</span>*pi<span style="color: #20b2aa;">)</span> * <span style="color: #20b2aa;">(</span><span style="color: #daa520;">0</span>.<span style="color: #daa520;">9856</span> * <span style="color: #20b2aa;">(</span>edist <span style="color: #ff00ff;">-</span> <span style="color: #daa520;">4</span><span style="color: #20b2aa;">)</span><span style="color: #ff00ff;">/</span><span style="color: #daa520;">360</span><span style="color: #20b2aa;">))</span>
<span style="color: #20b2aa;">}</span>
<span style="color: #ff6347;">.getNumeric</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>x, returnNumeric <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
        <span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span>x, <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>xi<span style="color: #20b2aa;">){</span>
                                d <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">strsplit</span><span style="color: #20b2aa;">(</span>xi, <span style="color: #20b2aa;">[</span>^<span style="color: #20b2aa;">[</span>:digit:<span style="color: #20b2aa;">]])[[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]]</span>
                                d <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>returnNumeric<span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">as.numeric</span><span style="color: #20b2aa;">(</span>d<span style="color: #20b2aa;">[</span>d!<span style="color: #ff00ff;">=</span><span style="color: #20b2aa;">])</span> <span style="color: #00ffff;">else</span> d<span style="color: #20b2aa;">[</span>d!<span style="color: #ff00ff;">=</span><span style="color: #20b2aa;">]</span>
                                d
                        <span style="color: #20b2aa;">})</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
