Org/RStoolbox_0.01_(2014-5-6_by_).html
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> radCor.R</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-R">        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>!reflectance &amp; method !<span style="color: #ff00ff;">=</span> APREF<span style="color: #20b2aa;">){</span>
<span style="color: #ff6347;">radCor</span> <span style="color: #ff00ff;">&lt;-</span>       <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>x, metaData, reflectance <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span>, thermal <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span>, satellite, bandSet <span style="color: #ff00ff;">=</span> full, gain, offset, G_rescale, B_rescale,
                sunElev, satZenith <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">0</span>, d, esun, date, SHV, hazeBand, atHaze,  method <span style="color: #ff00ff;">=</span> APREF<span style="color: #20b2aa;">){</span>


        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>!method <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>APREF, DOS, COSTZ, SDOS<span style="color: #20b2aa;">))</span> <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span>method must be one of <span style="color: #00ff00;">'APREF'</span>, <span style="color: #00ff00;">'DOS'</span>, <span style="color: #00ff00;">'COSTZ'</span> <span style="color: #00ff00;">'SDOS'</span>, call.<span style="color: #ff00ff;">=</span><span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>!reflectance &amp; method !<span style="color: #ff00ff;">=</span> APREF<span style="color: #20b2aa;">){</span>
                <span style="color: #00ffff;">warning</span><span style="color: #20b2aa;">(</span>For radiance calculations the <span style="color: #00ff00;">'method'</span> argument is ignored<span style="color: #20b2aa;">)</span>
                method <span style="color: #ff00ff;">&lt;-</span> APREF
        <span style="color: #20b2aa;">}</span>

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>!<span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>metaData<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>


                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.character</span><span style="color: #20b2aa;">(</span>metaData<span style="color: #20b2aa;">))</span> metaData <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">readMeta</span><span style="color: #20b2aa;">(</span>metaData<span style="color: #20b2aa;">)</span>

                satellite       <span style="color: #ff00ff;">&lt;-</span> metaData$UNIFIED_METADATA$SPACECRAFT_ID
                sensor          <span style="color: #ff00ff;">&lt;-</span> metaData$UNIFIED_METADATA$SENSOR_ID
                B_rescale       <span style="color: #ff00ff;">&lt;-</span> metaData$UNIFIED_METADATA$RAD_OFFSET
                G_rescale       <span style="color: #ff00ff;">&lt;-</span> metaData$UNIFIED_METADATA$RAD_GAIN
                d                       <span style="color: #ff00ff;">&lt;-</span> metaData$UNIFIED_METADATA$EARTH_SUN_DISTANCE
                sunElev         <span style="color: #ff00ff;">&lt;-</span> metaData$UNIFIED_METADATA$SUN_ELEVATION
                rad             <span style="color: #ff00ff;">&lt;-</span> metaData$UNIFIED_METADATA$RADIOMETRIC_RES
                K<span style="color: #daa520;">1</span>                      <span style="color: #ff00ff;">&lt;-</span> metaData$UNIFIED_METADATA$K<span style="color: #daa520;">1</span>
                K<span style="color: #daa520;">2</span>                      <span style="color: #ff00ff;">&lt;-</span> metaData$UNIFIED_METADATA$K<span style="color: #daa520;">2</span>

        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>

                sensor <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">1</span>
                rad <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">8</span>

                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>G_rescale<span style="color: #20b2aa;">)</span> | <span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>B_rescale<span style="color: #20b2aa;">)){</span>
                        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>offset<span style="color: #20b2aa;">)</span> | <span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>gain<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                                <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span>Please specify either a<span style="color: #20b2aa;">)</span> metaData, b<span style="color: #20b2aa;">)</span> gain and offset, c<span style="color: #20b2aa;">)</span> B_rescale and G_rescale, call. <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span> <span style="color: #20b2aa;">)</span>
                        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                                B_rescale <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">1</span><span style="color: #ff00ff;">/</span>gain
                                G_rescale <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff00ff;">-</span>offset<span style="color: #ff00ff;">/</span>gain
                        <span style="color: #20b2aa;">}</span>
                <span style="color: #20b2aa;">}</span>


                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>d<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>date<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span> 
                                <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span>Please specify either a<span style="color: #20b2aa;">)</span> edist or b<span style="color: #20b2aa;">)</span>date, call. <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span> 
                        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                                d <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">.ESdist</span><span style="color: #20b2aa;">(</span>date<span style="color: #20b2aa;">)</span> 
                        <span style="color: #20b2aa;">}</span>
                <span style="color: #20b2aa;">}</span>
        <span style="color: #20b2aa;">}</span>

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>satellite <span style="color: #ff00ff;">==</span> LANDSAT<span style="color: #daa520;">8</span> &amp; method !<span style="color: #ff00ff;">=</span> APREF<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #00ffff;">warning</span><span style="color: #20b2aa;">(</span>DOS, COSTZ and SDOS are currently not implemented <span style="color: #00ffff;">for</span> Landsat <span style="color: #daa520;">8</span>. Using official reflectance calibration coefficients, i.e. output corresponds to method <span style="color: #ff00ff;">=</span> <span style="color: #00ff00;">'APREF'</span>, call. <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span> 
                method <span style="color: #ff00ff;">&lt;-</span> APREF
        <span style="color: #20b2aa;">}</span>

        satZenith       <span style="color: #ff00ff;">&lt;-</span> satZenith * pi <span style="color: #ff00ff;">/</span> <span style="color: #daa520;">180</span>
        satphi          <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">cos</span><span style="color: #20b2aa;">(</span>satZenith<span style="color: #20b2aa;">)</span>
        suntheta        <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">cos</span><span style="color: #20b2aa;">((</span><span style="color: #daa520;">90</span> <span style="color: #ff00ff;">-</span> sunElev<span style="color: #20b2aa;">)</span> * pi <span style="color: #ff00ff;">/</span> <span style="color: #daa520;">180</span><span style="color: #20b2aa;">)</span>       


        sDB <span style="color: #ff00ff;">&lt;-</span> LANDSAT.db<span style="color: #20b2aa;">[[</span>satellite<span style="color: #20b2aa;">]][[</span>sensor<span style="color: #20b2aa;">]]</span>



        sDB     <span style="color: #ff00ff;">&lt;-</span> sDB<span style="color: #20b2aa;">[</span><span style="color: #ff6347;">match</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>B, <span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">.getNumeric</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">))</span>,<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">))</span>, sDB$band<span style="color: #20b2aa;">)</span>,<span style="color: #20b2aa;">]</span>  
        sDB             <span style="color: #ff00ff;">&lt;-</span> sDB<span style="color: #20b2aa;">[</span><span style="color: #ff6347;">match</span><span style="color: #20b2aa;">(</span>sDB$band, <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>B,<span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">.getNumeric</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">))</span>,<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">)))</span>,<span style="color: #20b2aa;">]</span>

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">any</span><span style="color: #20b2aa;">(</span>bandSet <span style="color: #ff00ff;">==</span> full<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                bandSet <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span>
        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.numeric</span><span style="color: #20b2aa;">(</span>bandSet<span style="color: #20b2aa;">))</span> bandSet <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>B, bandSet<span style="color: #20b2aa;">)</span>
        <span style="color: #20b2aa;">}</span>       

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>metaData<span style="color: #20b2aa;">))</span>   <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>B_rescale<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>G_rescale<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&lt;-</span> bandSet

        origBands       <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span>   
        corBands        <span style="color: #ff00ff;">&lt;-</span> sDB<span style="color: #20b2aa;">[</span>!sDB$bandtype <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>TIR, PAN<span style="color: #20b2aa;">)</span>, band<span style="color: #20b2aa;">]</span>
        bandSet         <span style="color: #ff00ff;">&lt;-</span> bandSet<span style="color: #20b2aa;">[</span>bandSet <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> corBands<span style="color: #20b2aa;">]</span>
        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>thermal<span style="color: #20b2aa;">){</span>
                tirBands        <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>satellite<span style="color: #ff00ff;">==</span>LANDSAT<span style="color: #daa520;">8</span><span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>B<span style="color: #daa520;">10</span>, B<span style="color: #daa520;">11</span><span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">else</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>B<span style="color: #daa520;">6</span>, B<span style="color: #daa520;">6</span>_VCID_<span style="color: #daa520;">1</span>, B<span style="color: #daa520;">6</span>_VCID_<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span> 
                tirBands        <span style="color: #ff00ff;">&lt;-</span> origBands<span style="color: #20b2aa;">[</span>origBands <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> tirBands<span style="color: #20b2aa;">]</span>
        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                tirBands <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">NULL</span>
        <span style="color: #20b2aa;">}</span>
        exclBands       <span style="color: #ff00ff;">&lt;-</span> origBands<span style="color: #20b2aa;">[</span>!origBands <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>bandSet, tirBands<span style="color: #20b2aa;">)]</span>

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">length</span><span style="color: #20b2aa;">(</span>exclBands<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&gt;</span> <span style="color: #daa520;">0</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                xexc <span style="color: #ff00ff;">&lt;-</span> x<span style="color: #20b2aa;">[[</span>exclBands<span style="color: #20b2aa;">]]</span> 
        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                xexc <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">NULL</span>
        <span style="color: #20b2aa;">}</span>

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>esun<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                esun <span style="color: #ff00ff;">&lt;-</span> sDB<span style="color: #20b2aa;">[</span>,esun<span style="color: #20b2aa;">]</span> 
                <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>esun<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&lt;-</span> sDB$band
        <span style="color: #20b2aa;">}</span>
        xref <span style="color: #ff00ff;">&lt;-</span> x<span style="color: #20b2aa;">[[</span>bandSet<span style="color: #20b2aa;">]]</span>

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>reflectance<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span>Bands to convert to reflectance: , <span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span>bandSet, collapse <span style="color: #ff00ff;">=</span> , <span style="color: #20b2aa;">))</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">length</span><span style="color: #20b2aa;">(</span>tirBands<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&gt;</span> <span style="color: #daa520;">0</span> &amp; thermal<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span>Thermal bands to convert to brightness temperatures: , <span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span>tirBands, collapse<span style="color: #ff00ff;">=</span>, <span style="color: #20b2aa;">))</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">length</span><span style="color: #20b2aa;">(</span>exclBands<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&gt;</span> <span style="color: #daa520;">0</span><span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span>Excluding bands: , <span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span>exclBands, collapse <span style="color: #ff00ff;">=</span> , <span style="color: #20b2aa;">))</span>   
        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                bandSet <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>bandSet, tirBands<span style="color: #20b2aa;">)</span>
                <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span>Bands to convert to toa radiance: , <span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span>bandSet, collapse <span style="color: #ff00ff;">=</span> , <span style="color: #20b2aa;">))</span>
        <span style="color: #20b2aa;">}</span>


        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>thermal &amp; reflectance &amp; <span style="color: #ff6347;">length</span><span style="color: #20b2aa;">(</span>tirBands<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&gt;</span> <span style="color: #daa520;">0</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span>Processing thermal <span style="color: #ff6347;">band</span><span style="color: #20b2aa;">(</span>s<span style="color: #20b2aa;">))</span>

                L <span style="color: #ff00ff;">&lt;-</span> G_rescale<span style="color: #20b2aa;">[</span>tirBands<span style="color: #20b2aa;">]</span> * x<span style="color: #20b2aa;">[[</span>tirBands<span style="color: #20b2aa;">]]</span> <span style="color: #ff00ff;">+</span> B_rescale<span style="color: #20b2aa;">[</span>tirBands<span style="color: #20b2aa;">]</span>

                xtir <span style="color: #ff00ff;">&lt;-</span> K<span style="color: #daa520;">2</span> <span style="color: #ff00ff;">/</span> <span style="color: #ff6347;">log</span><span style="color: #20b2aa;">(</span>K<span style="color: #daa520;">1</span><span style="color: #ff00ff;">/</span>L <span style="color: #ff00ff;">+</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> 
                <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>xtir<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&lt;-</span> tirBands
        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                xtir <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">NULL</span>
        <span style="color: #20b2aa;">}</span>

        <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span>Processing radiance <span style="color: #ff00ff;">/</span> reflectance<span style="color: #20b2aa;">)</span>


        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>method <span style="color: #ff00ff;">==</span> APREF<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                TAUz <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">1</span>
                TAUv <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">1</span>
                Edown <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">0</span>
                Lhaze <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">0</span>

        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>


                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>SHV<span style="color: #20b2aa;">)){</span>
                        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>hazeBand<span style="color: #20b2aa;">))</span>  hazeBand <span style="color: #ff00ff;">&lt;-</span> B<span style="color: #daa520;">1</span>
                        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">length</span><span style="color: #20b2aa;">(</span>hazeBand<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&gt;</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                                <span style="color: #00ffff;">warning</span><span style="color: #20b2aa;">(</span>Automatic search <span style="color: #00ffff;">for</span> SHV values is intended <span style="color: #00ffff;">for</span> one band only. For more bands please estimate hzae DNs manually using <span style="color: #ff6347;">estimateSHV</span><span style="color: #20b2aa;">()</span> \nhazeBand was automatically reset to <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>
                                hazeBand <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">1</span> <span style="color: #20b2aa;">}</span>
                        <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span>SHV was not provided <span style="color: #ff00ff;">-&gt;</span> Estimating SHV automatically<span style="color: #20b2aa;">)</span>
                        dP <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">02</span>

                        SHV <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">suppressWarnings</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">estimateSHV</span><span style="color: #20b2aa;">(</span>x, hazeBand <span style="color: #ff00ff;">=</span> hazeBand, darkProp <span style="color: #ff00ff;">=</span> dP , plot <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span>, returnTables <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">))</span>
                        <span style="color: #00ffff;">while</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.na</span><span style="color: #20b2aa;">(</span>SHV<span style="color: #20b2aa;">[[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]])){</span>
                                dP      <span style="color: #ff00ff;">&lt;-</span> dP * <span style="color: #daa520;">0</span>.<span style="color: #daa520;">9</span>
                                SHV <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">suppressWarnings</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">estimateSHV</span><span style="color: #20b2aa;">(</span>SHV, hazeBand <span style="color: #ff00ff;">=</span> hazeBand, darkProp <span style="color: #ff00ff;">=</span> dP, plot <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span>, returnTables <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">))</span>
                        <span style="color: #20b2aa;">}</span>
                        <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>SHV estimated as: , SHV<span style="color: #20b2aa;">[[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]]))</span>
                        SHV <span style="color: #ff00ff;">&lt;-</span> SHV<span style="color: #20b2aa;">[[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]]</span>
                <span style="color: #20b2aa;">}</span>



                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>method <span style="color: #ff00ff;">==</span> SDOS<span style="color: #20b2aa;">)</span> hazeBand <span style="color: #ff00ff;">&lt;-</span> bandSet 
                TAUz <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">1</span>
                TAUv <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">1</span>
                Edown <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">0</span>                              
                <span style="color: #00ffff;">if</span> <span style="color: #20b2aa;">(</span>method <span style="color: #ff00ff;">==</span> COSTZ<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                        TAUz <span style="color: #ff00ff;">&lt;-</span> suntheta
                        TAUv <span style="color: #ff00ff;">&lt;-</span> satphi
                <span style="color: #20b2aa;">}</span>  


                Ldo <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">01</span> * <span style="color: #20b2aa;">((</span>esun<span style="color: #20b2aa;">[</span>hazeBand<span style="color: #20b2aa;">]</span> * suntheta * TAUz<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">+</span> Edown<span style="color: #20b2aa;">)</span> * TAUv <span style="color: #ff00ff;">/</span> <span style="color: #20b2aa;">(</span>pi * d ^ <span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span>
                Lhaze <span style="color: #ff00ff;">&lt;-</span> <span style="color: #20b2aa;">(</span>SHV * G_rescale<span style="color: #20b2aa;">[</span>hazeBand<span style="color: #20b2aa;">]</span> <span style="color: #ff00ff;">+</span> B_rescale<span style="color: #20b2aa;">[</span>hazeBand<span style="color: #20b2aa;">])</span> <span style="color: #ff00ff;">-</span> Ldo

                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>method <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>DOS, COSTZ<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>         

                        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>atHaze<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                                atHaze.db <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">data.frame</span><span style="color: #20b2aa;">(</span>min <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">1</span>,<span style="color: #daa520;">56</span>,<span style="color: #daa520;">76</span>,<span style="color: #daa520;">96</span>,<span style="color: #daa520;">116</span><span style="color: #20b2aa;">)</span>, max <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">55</span>,<span style="color: #daa520;">75</span>,<span style="color: #daa520;">95</span>,<span style="color: #daa520;">115</span>,<span style="color: #daa520;">255</span><span style="color: #20b2aa;">))</span> <span style="color: #ff00ff;">/</span> <span style="color: #daa520;">255</span> * <span style="color: #20b2aa;">(</span><span style="color: #daa520;">2</span>^rad<span style="color: #ff00ff;">-</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>
                                atHaze <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>veryClear, clear, moderate, hazy, veryHazy<span style="color: #20b2aa;">)[</span>Lhaze <span style="color: #ff00ff;">&gt;</span> atHaze.db<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span> &amp; Lhaze <span style="color: #ff00ff;">&lt;=</span> atHaze.db<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">2</span><span style="color: #20b2aa;">]]</span>
                                <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span>Selcting atmosphere: <span style="color: #00ff00;">', atHaze, '</span><span style="color: #20b2aa;">)</span>
                        <span style="color: #20b2aa;">}</span>               
                        Lhaze     <span style="color: #ff00ff;">&lt;-</span> Lhaze  * sDB<span style="color: #20b2aa;">[</span><span style="color: #ff6347;">match</span><span style="color: #20b2aa;">(</span>bandSet,sDB$band<span style="color: #20b2aa;">)</span>, <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>hazeBand,_, atHaze<span style="color: #20b2aa;">)]</span>


                        NORM  <span style="color: #ff00ff;">&lt;-</span> G_rescale<span style="color: #20b2aa;">[</span>bandSet<span style="color: #20b2aa;">]</span> <span style="color: #ff00ff;">/</span> G_rescale<span style="color: #20b2aa;">[</span>hazeBand<span style="color: #20b2aa;">]</span>
                        Lhaze <span style="color: #ff00ff;">&lt;-</span> Lhaze * NORM <span style="color: #ff00ff;">+</span> B_rescale<span style="color: #20b2aa;">[</span>bandSet<span style="color: #20b2aa;">]</span>      
                <span style="color: #20b2aa;">}</span>

                Lhaze <span style="color: #20b2aa;">[</span>Lhaze <span style="color: #ff00ff;">&lt;</span> <span style="color: #daa520;">0</span><span style="color: #20b2aa;">]</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">0</span>
        <span style="color: #20b2aa;">}</span>

        B_rescale       <span style="color: #ff00ff;">&lt;-</span> B_rescale<span style="color: #20b2aa;">[</span>bandSet<span style="color: #20b2aa;">]</span>
        G_rescale       <span style="color: #ff00ff;">&lt;-</span> G_rescale<span style="color: #20b2aa;">[</span>bandSet<span style="color: #20b2aa;">]</span>
        esun <span style="color: #ff00ff;">&lt;-</span> esun<span style="color: #20b2aa;">[</span>bandSet<span style="color: #20b2aa;">]</span>

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>satellite !<span style="color: #ff00ff;">=</span> LANDSAT<span style="color: #daa520;">8</span><span style="color: #20b2aa;">){</span>

                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>!reflectance<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>

                        xref <span style="color: #ff00ff;">&lt;-</span>  <span style="color: #20b2aa;">(</span> xref * G_rescale <span style="color: #ff00ff;">+</span> B_rescale<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">/</span> suntheta
                <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>

                        C <span style="color: #ff00ff;">&lt;-</span> <span style="color: #20b2aa;">(</span>pi * d ^ <span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span><span style="color: #ff00ff;">/</span><span style="color: #20b2aa;">(</span>TAUv * <span style="color: #20b2aa;">(</span>esun * suntheta * TAUz <span style="color: #ff00ff;">+</span> Edown<span style="color: #20b2aa;">))</span>     
                        b <span style="color: #ff00ff;">&lt;-</span> C * <span style="color: #20b2aa;">(</span>B_rescale <span style="color: #ff00ff;">-</span> Lhaze<span style="color: #20b2aa;">)</span>
                        a <span style="color: #ff00ff;">&lt;-</span> C * G_rescale 
                        xref <span style="color: #ff00ff;">&lt;-</span>  a * xref  <span style="color: #ff00ff;">+</span> b
                <span style="color: #20b2aa;">}</span>

        <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>

                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>reflectance<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                        B_rescale               <span style="color: #ff00ff;">&lt;-</span> metaData$UNIFIED_METADATA$REF_OFFSET<span style="color: #20b2aa;">[</span>bandSet<span style="color: #20b2aa;">]</span>
                        G_rescale               <span style="color: #ff00ff;">&lt;-</span> metaData$UNIFIED_METADATA$REF_GAIN<span style="color: #20b2aa;">[</span>bandSet<span style="color: #20b2aa;">]</span>
                <span style="color: #20b2aa;">}</span> 


                xref <span style="color: #ff00ff;">&lt;-</span>  <span style="color: #20b2aa;">(</span>G_rescale * xref <span style="color: #ff00ff;">+</span> B_rescale<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">/</span> suntheta


        <span style="color: #20b2aa;">}</span>


        x <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">stack</span><span style="color: #20b2aa;">(</span>xref,xtir, xexc<span style="color: #20b2aa;">)</span>
        x <span style="color: #ff00ff;">&lt;-</span> x<span style="color: #20b2aa;">[[</span>origBands<span style="color: #20b2aa;">]]</span>

        <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">}</span>
LANDSAT.db <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>
                LANDSAT<span style="color: #daa520;">5</span> <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">list</span> <span style="color: #20b2aa;">(</span>
                                TM <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">data.frame</span><span style="color: #20b2aa;">(</span>band <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>B, <span style="color: #daa520;">1</span>:<span style="color: #daa520;">7</span><span style="color: #20b2aa;">)</span>,
                                                bandtype <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span>REF, <span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>, TIR, REF<span style="color: #20b2aa;">)</span>,
                                                centerWavl <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">0</span>.<span style="color: #daa520;">485</span>, <span style="color: #daa520;">0</span>.<span style="color: #daa520;">569</span>, <span style="color: #daa520;">0</span>.<span style="color: #daa520;">66</span>, <span style="color: #daa520;">0</span>.<span style="color: #daa520;">840</span>, <span style="color: #daa520;">1</span>.<span style="color: #daa520;">676</span>, <span style="color: #daa520;">11</span>.<span style="color: #daa520;">435</span>, <span style="color: #daa520;">2</span>.<span style="color: #daa520;">223</span><span style="color: #20b2aa;">)</span>,
                                                spatRes<span style="color: #daa520;">1</span> <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>, <span style="color: #daa520;">7</span><span style="color: #20b2aa;">)</span>,
                                                spatRes<span style="color: #daa520;">2</span> <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>,<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>, <span style="color: #daa520;">60</span>, <span style="color: #daa520;">30</span><span style="color: #20b2aa;">)</span>, 
                                                esun <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">1983</span>, <span style="color: #daa520;">1796</span>, <span style="color: #daa520;">1536</span>, <span style="color: #daa520;">1031</span>, <span style="color: #daa520;">220</span>, <span style="color: #daa520;">NA</span>, <span style="color: #daa520;">83</span>.<span style="color: #daa520;">44</span><span style="color: #20b2aa;">))</span>
                <span style="color: #20b2aa;">)</span>,
                LANDSAT<span style="color: #daa520;">7</span> <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>
                                ETM <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">data.frame</span><span style="color: #20b2aa;">(</span>band <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>B,<span style="color: #daa520;">1</span>:<span style="color: #daa520;">8</span><span style="color: #20b2aa;">)</span>,
                                                bandtype <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span>REF, <span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>, TIR, REF, PAN<span style="color: #20b2aa;">)</span>,
                                                spatRes<span style="color: #daa520;">1</span> <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>, <span style="color: #daa520;">7</span><span style="color: #20b2aa;">)</span>, <span style="color: #daa520;">15</span><span style="color: #20b2aa;">)</span>,
                                                spatRes<span style="color: #daa520;">2</span> <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>,<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>, <span style="color: #daa520;">60</span>, <span style="color: #daa520;">30</span>, <span style="color: #daa520;">15</span><span style="color: #20b2aa;">)</span>,  
                                                centerWavl <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">0</span>.<span style="color: #daa520;">485</span>, <span style="color: #daa520;">0</span>.<span style="color: #daa520;">560</span>, <span style="color: #daa520;">0</span>.<span style="color: #daa520;">660</span>, <span style="color: #daa520;">0</span>.<span style="color: #daa520;">835</span>, <span style="color: #daa520;">1</span>.<span style="color: #daa520;">650</span>,<span style="color: #daa520;">11</span>.<span style="color: #daa520;">335</span>,<span style="color: #daa520;">2</span>.<span style="color: #daa520;">220</span>,<span style="color: #daa520;">0</span>.<span style="color: #daa520;">706</span><span style="color: #20b2aa;">)</span>,
                                                esun <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">1997</span>,<span style="color: #daa520;">1812</span>,<span style="color: #daa520;">1533</span>,<span style="color: #daa520;">1039</span>,<span style="color: #daa520;">230</span>.<span style="color: #daa520;">8</span>,<span style="color: #daa520;">NA</span>,<span style="color: #daa520;">84</span>.<span style="color: #daa520;">9</span>,<span style="color: #daa520;">1362</span><span style="color: #20b2aa;">)</span>
                                <span style="color: #20b2aa;">)</span>
                <span style="color: #20b2aa;">)</span>,
                LANDSAT<span style="color: #daa520;">8</span> <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>
                                OLI_TIRS <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">data.frame</span><span style="color: #20b2aa;">(</span>band <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>B,<span style="color: #daa520;">1</span>:<span style="color: #daa520;">11</span><span style="color: #20b2aa;">)</span>, BQA<span style="color: #20b2aa;">)</span>,
                                                bandtype <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span>REF, <span style="color: #daa520;">7</span><span style="color: #20b2aa;">)</span>, PAN, REF, TIR, TIR, QA<span style="color: #20b2aa;">)</span>,
                                                spatRes<span style="color: #daa520;">1</span> <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>, <span style="color: #daa520;">7</span><span style="color: #20b2aa;">)</span>, <span style="color: #daa520;">15</span>, <span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>,<span style="color: #daa520;">4</span><span style="color: #20b2aa;">))</span>,
                                                spatRes<span style="color: #daa520;">2</span> <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>, <span style="color: #daa520;">7</span><span style="color: #20b2aa;">)</span>, <span style="color: #daa520;">15</span>, <span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>,<span style="color: #daa520;">4</span><span style="color: #20b2aa;">))</span>,  
                                                centerWavl <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">0</span>.<span style="color: #daa520;">44</span>,<span style="color: #daa520;">0</span>.<span style="color: #daa520;">48</span>,<span style="color: #daa520;">0</span>.<span style="color: #daa520;">56</span>,<span style="color: #daa520;">0</span>.<span style="color: #daa520;">655</span>,<span style="color: #daa520;">0</span>.<span style="color: #daa520;">865</span>,<span style="color: #daa520;">1</span>.<span style="color: #daa520;">61</span>,<span style="color: #daa520;">2</span>.<span style="color: #daa520;">2</span>,<span style="color: #daa520;">0</span>.<span style="color: #daa520;">59</span>,<span style="color: #daa520;">1</span>.<span style="color: #daa520;">37</span>,<span style="color: #daa520;">10</span>.<span style="color: #daa520;">6</span>,<span style="color: #daa520;">11</span>.<span style="color: #daa520;">5</span>, <span style="color: #daa520;">NA</span><span style="color: #20b2aa;">)</span>, 
                                                esun <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">NA</span>, <span style="color: #daa520;">2067</span>, <span style="color: #daa520;">1893</span>, <span style="color: #daa520;">1603</span>, <span style="color: #daa520;">972</span>.<span style="color: #daa520;">6</span>, <span style="color: #daa520;">245</span>, <span style="color: #daa520;">79</span>.<span style="color: #daa520;">72</span>, <span style="color: #daa520;">NA</span>, <span style="color: #daa520;">399</span>.<span style="color: #daa520;">7</span>, <span style="color: #daa520;">NA</span>, <span style="color: #daa520;">NA</span>, <span style="color: #daa520;">NA</span> <span style="color: #20b2aa;">)</span> 
                                <span style="color: #20b2aa;">)</span>
                <span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">)</span> 
exponents <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff00ff;">-</span><span style="color: #daa520;">4</span>, <span style="color: #ff00ff;">-</span><span style="color: #daa520;">2</span>, <span style="color: #ff00ff;">-</span><span style="color: #daa520;">1</span>, <span style="color: #ff00ff;">-</span>.<span style="color: #daa520;">7</span>, <span style="color: #ff00ff;">-</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>
<span style="color: #00ffff;">for</span><span style="color: #20b2aa;">(</span>s <span style="color: #00ffff;">in</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>LANDSAT.db<span style="color: #20b2aa;">)){</span>
        bandType                <span style="color: #ff00ff;">&lt;-</span> LANDSAT.db<span style="color: #20b2aa;">[[</span>s<span style="color: #20b2aa;">]][[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]][</span>,bandtype<span style="color: #20b2aa;">]</span> <span style="color: #ff00ff;">==</span> REF
        centerWavl              <span style="color: #ff00ff;">&lt;-</span> LANDSAT.db<span style="color: #20b2aa;">[[</span>s<span style="color: #20b2aa;">]][[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]][</span>bandType, centerWavl<span style="color: #20b2aa;">]</span> 
        bands                   <span style="color: #ff00ff;">&lt;-</span> LANDSAT.db<span style="color: #20b2aa;">[[</span>s<span style="color: #20b2aa;">]][[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]][</span>bandType, band<span style="color: #20b2aa;">]</span>


        TAB<span style="color: #daa520;">1</span>                    <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span>exponents, <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span> centerWavl ^ x<span style="color: #20b2aa;">)</span>
        <span style="color: #ff6347;">rownames</span><span style="color: #20b2aa;">(</span>TAB<span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>  <span style="color: #ff00ff;">&lt;-</span> bands
        <span style="color: #ff6347;">colnames</span><span style="color: #20b2aa;">(</span>TAB<span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>  <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>veryClear, clear, moderate, hazy, veryHazy<span style="color: #20b2aa;">)</span>


        TAB<span style="color: #daa520;">2</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">lapply</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>B, <span style="color: #daa520;">1</span>:<span style="color: #daa520;">4</span><span style="color: #20b2aa;">)</span>, <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>SHVB<span style="color: #20b2aa;">){</span> <span style="color: #ff6347;">sweep</span><span style="color: #20b2aa;">(</span>TAB<span style="color: #daa520;">1</span>, <span style="color: #daa520;">2</span>, TAB<span style="color: #daa520;">1</span><span style="color: #20b2aa;">[</span>SHVB,<span style="color: #20b2aa;">]</span>, <span style="color: #ff00ff;">/</span><span style="color: #20b2aa;">)})</span>
        TAB<span style="color: #daa520;">2</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">do.call</span><span style="color: #20b2aa;">(</span>cbind, TAB<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span>
        <span style="color: #ff6347;">colnames</span><span style="color: #20b2aa;">(</span>TAB<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>B, <span style="color: #daa520;">1</span>:<span style="color: #daa520;">4</span><span style="color: #20b2aa;">)</span>, each <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>,_, <span style="color: #ff6347;">colnames</span><span style="color: #20b2aa;">(</span>TAB<span style="color: #daa520;">2</span><span style="color: #20b2aa;">))</span>

        LANDSAT.db<span style="color: #20b2aa;">[[</span>s<span style="color: #20b2aa;">]][[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]]</span> <span style="color: #ff00ff;">&lt;-</span>  <span style="color: #ff6347;">merge</span><span style="color: #20b2aa;">(</span>LANDSAT.db<span style="color: #20b2aa;">[[</span>s<span style="color: #20b2aa;">]][[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]]</span> , TAB<span style="color: #daa520;">2</span>, by.x <span style="color: #ff00ff;">=</span> band, by.y <span style="color: #ff00ff;">=</span> row.names, all.x <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span>, sort <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
