Org/RStoolbox_0.01_(2014-5-6_by_).org
* spectralIndices.R
#+BEGIN_SRC R 
spectralIndices <- function(inputRaster, indices = NDVI, sensor, bands , maskRaster = NULL, verbose = FALSE, ... ) {
	
	
	
	
	
	
	
	
	SENSORS <- list(
			LANDSAT5 = list(BLUE = B1, GREEN = B2, RED = B3, NIR = B4, MIR = B7),
			LANDSAT7 = list(BLUE = B1, GREEN = B2, RED = B3, NIR = B4),
			LANDSAT8 = list(BLUE = B2, GREEN = B3, RED = B4, NIR = B5)
	)
	
	if(!missing(sensor)){
		if(!sensor %in% names(SENSORS)) stop(paste0(Unknown sensor. Please provide the 'bands' argument or 'sensor' as one of , names(SENSORS)))
		bands <- SENSORS[[sensor]]
		if(any(!bands %in% names(inputRaster))) stop(Bandnames of inputRaster do not match the required format or are missing. Please provide 'bands' argument manually or make sure the names(inputRaster) follow the 'B1' 'B2'  ... format if you want to make use of the 'sensor' argument.)
	}
	bands <- lapply(bands, function(x) if(is.character(x)) which(names(inputRaster) == x) else x )
	
	
	INDICES <-  list(
			SR 		= function(NIR, RED) {NIR / RED},
			DVI		= function(NIR, RED) {NIR-RED},
			NDVI	= function(NIR, RED) {(NIR-RED)/(NIR+RED)}, 
			TVI 	= function(NIR, RED) {(((NIR-RED)/(NIR+RED))+0.5)^0.5}, 
			MSAVI	= function(NIR, RED) {NIR + 0.5 - (0.5 * sqrt((2 * NIR + 1)^2 - 8 * (NIR - (2 * RED))))},
			MSAVI2	= function(NIR, RED) {(2 * (NIR + 1) - sqrt((2 * NIR + 1)^2 - 8 * (NIR - RED))) / 2},
			GEMI	= function(NIR, RED) {(((NIR^2 - RED^2) * 2 + (NIR * 1.5) + (RED * 0.5) ) / (NIR + RED + 0.5)) * (1 - ((((NIR^2 - RED^2) * 2 + (NIR * 1.5) + (RED * 0.5) ) / (NIR + RED + 0.5)) * 0.25)) - ((RED - 0.125) / (1 - RED))},                   
			SLAVI	= function(RED, MIR) {NIR / (RED + MIR)},
			EVI		= function(NIR, RED, BLUE) {G * ((NIR - RED) / (NIR + C1 * RED - C2 * BLUE + L))}
	)
	
	
	args <- lapply(indices, function(index) {
				need <- names(formals(INDICES[[index]]))	
				if(any(!need %in% names(bands))) stop(Band specification(s) of >> , paste(names(bands)[!names(bands) %in% need], collapse = ,), 
							 << are missing or do not match layer names in the brick/stack. \nPlease specify the correct layer number or name in a list, e.g. bands = list(RED = 'B4', NIR = 'B5'), call. = FALSE)
				need <- unlist(bands[need])
			})
	names(args) <- indices 
	
	
	inList <- lapply(indices, function(index) {
				if(verbose) print(paste0(Calculating , index))
			m<-	overlay(inputRaster[[args[[index]]]], fun = INDICES[[index]])
			})
	
	
	outStack <- stack(inList)
		
	
	
	
	if(any(grepl(file, names(list(...))))) outStack <-  writeRaster(outStack, ...)
	
	names(outStack) <- indices	 
	return(outStack)
}
#+END_SRC
