Org/RStoolbox_0.01_(2014-5-6_by_).html
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> RStoolbox.R</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #daa520;">NULL</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> spectralIndices.R</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">spectralIndices</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>inputRaster, indices <span style="color: #ff00ff;">=</span> NDVI, sensor, bands , maskRaster <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">NULL</span>, verbose <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span>, ... <span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>








        SENSORS <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>
                        LANDSAT<span style="color: #daa520;">5</span> <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>BLUE <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">1</span>, GREEN <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">2</span>, RED <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">3</span>, NIR <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">4</span>, MIR <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">7</span><span style="color: #20b2aa;">)</span>,
                        LANDSAT<span style="color: #daa520;">7</span> <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>BLUE <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">1</span>, GREEN <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">2</span>, RED <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">3</span>, NIR <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">4</span><span style="color: #20b2aa;">)</span>,
                        LANDSAT<span style="color: #daa520;">8</span> <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>BLUE <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">2</span>, GREEN <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">3</span>, RED <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">4</span>, NIR <span style="color: #ff00ff;">=</span> B<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>
        <span style="color: #20b2aa;">)</span>

        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>!<span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>sensor<span style="color: #20b2aa;">)){</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>!sensor <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>SENSORS<span style="color: #20b2aa;">))</span> <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>Unknown sensor. Please provide the <span style="color: #00ff00;">'bands'</span> argument or <span style="color: #00ff00;">'sensor'</span> as one of , <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>SENSORS<span style="color: #20b2aa;">)))</span>
                bands <span style="color: #ff00ff;">&lt;-</span> SENSORS<span style="color: #20b2aa;">[[</span>sensor<span style="color: #20b2aa;">]]</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">any</span><span style="color: #20b2aa;">(</span>!bands <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>inputRaster<span style="color: #20b2aa;">)))</span> <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span>Bandnames of inputRaster do not match the required format or are missing. Please provide <span style="color: #00ff00;">'bands'</span> argument manually or make sure the <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>inputRaster<span style="color: #20b2aa;">)</span> follow the <span style="color: #00ff00;">'B</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">'</span> <span style="color: #00ff00;">'B</span><span style="color: #daa520;">2</span><span style="color: #00ff00;">'</span>  ... format <span style="color: #00ffff;">if</span> you want to make use of the <span style="color: #00ff00;">'sensor'</span> argument.<span style="color: #20b2aa;">)</span>
        <span style="color: #20b2aa;">}</span>
        bands <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">lapply</span><span style="color: #20b2aa;">(</span>bands, <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.character</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">))</span> <span style="color: #ff6347;">which</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>inputRaster<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">==</span> x<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">else</span> x <span style="color: #20b2aa;">)</span>


        INDICES <span style="color: #ff00ff;">&lt;-</span>  <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>
                        SR              <span style="color: #ff00ff;">=</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>NIR <span style="color: #ff00ff;">/</span> RED<span style="color: #20b2aa;">}</span>,
                        DVI             <span style="color: #ff00ff;">=</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>NIR<span style="color: #ff00ff;">-</span>RED<span style="color: #20b2aa;">}</span>,
                        NDVI    <span style="color: #ff00ff;">=</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{(</span>NIR<span style="color: #ff00ff;">-</span>RED<span style="color: #20b2aa;">)</span><span style="color: #ff00ff;">/</span><span style="color: #20b2aa;">(</span>NIR<span style="color: #ff00ff;">+</span>RED<span style="color: #20b2aa;">)}</span>, 
                        TVI     <span style="color: #ff00ff;">=</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{(((</span>NIR<span style="color: #ff00ff;">-</span>RED<span style="color: #20b2aa;">)</span><span style="color: #ff00ff;">/</span><span style="color: #20b2aa;">(</span>NIR<span style="color: #ff00ff;">+</span>RED<span style="color: #20b2aa;">))</span><span style="color: #ff00ff;">+</span><span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>^<span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">}</span>, 
                        MSAVI   <span style="color: #ff00ff;">=</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>NIR <span style="color: #ff00ff;">+</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span> <span style="color: #ff00ff;">-</span> <span style="color: #20b2aa;">(</span><span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span> * <span style="color: #ff6347;">sqrt</span><span style="color: #20b2aa;">((</span><span style="color: #daa520;">2</span> * NIR <span style="color: #ff00ff;">+</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>^<span style="color: #daa520;">2</span> <span style="color: #ff00ff;">-</span> <span style="color: #daa520;">8</span> * <span style="color: #20b2aa;">(</span>NIR <span style="color: #ff00ff;">-</span> <span style="color: #20b2aa;">(</span><span style="color: #daa520;">2</span> * RED<span style="color: #20b2aa;">))))}</span>,
                        MSAVI<span style="color: #daa520;">2</span>  <span style="color: #ff00ff;">=</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{(</span><span style="color: #daa520;">2</span> * <span style="color: #20b2aa;">(</span>NIR <span style="color: #ff00ff;">+</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">-</span> <span style="color: #ff6347;">sqrt</span><span style="color: #20b2aa;">((</span><span style="color: #daa520;">2</span> * NIR <span style="color: #ff00ff;">+</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>^<span style="color: #daa520;">2</span> <span style="color: #ff00ff;">-</span> <span style="color: #daa520;">8</span> * <span style="color: #20b2aa;">(</span>NIR <span style="color: #ff00ff;">-</span> RED<span style="color: #20b2aa;">)))</span> <span style="color: #ff00ff;">/</span> <span style="color: #daa520;">2</span><span style="color: #20b2aa;">}</span>,
                        GEMI    <span style="color: #ff00ff;">=</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{(((</span>NIR^<span style="color: #daa520;">2</span> <span style="color: #ff00ff;">-</span> RED^<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span> * <span style="color: #daa520;">2</span> <span style="color: #ff00ff;">+</span> <span style="color: #20b2aa;">(</span>NIR * <span style="color: #daa520;">1</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">+</span> <span style="color: #20b2aa;">(</span>RED * <span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">/</span> <span style="color: #20b2aa;">(</span>NIR <span style="color: #ff00ff;">+</span> RED <span style="color: #ff00ff;">+</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">))</span> * <span style="color: #20b2aa;">(</span><span style="color: #daa520;">1</span> <span style="color: #ff00ff;">-</span> <span style="color: #20b2aa;">((((</span>NIR^<span style="color: #daa520;">2</span> <span style="color: #ff00ff;">-</span> RED^<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span> * <span style="color: #daa520;">2</span> <span style="color: #ff00ff;">+</span> <span style="color: #20b2aa;">(</span>NIR * <span style="color: #daa520;">1</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">+</span> <span style="color: #20b2aa;">(</span>RED * <span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">/</span> <span style="color: #20b2aa;">(</span>NIR <span style="color: #ff00ff;">+</span> RED <span style="color: #ff00ff;">+</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">))</span> * <span style="color: #daa520;">0</span>.<span style="color: #daa520;">25</span><span style="color: #20b2aa;">))</span> <span style="color: #ff00ff;">-</span> <span style="color: #20b2aa;">((</span>RED <span style="color: #ff00ff;">-</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">125</span><span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">/</span> <span style="color: #20b2aa;">(</span><span style="color: #daa520;">1</span> <span style="color: #ff00ff;">-</span> RED<span style="color: #20b2aa;">))}</span>,                   
                        SLAVI   <span style="color: #ff00ff;">=</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>RED, MIR<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>NIR <span style="color: #ff00ff;">/</span> <span style="color: #20b2aa;">(</span>RED <span style="color: #ff00ff;">+</span> MIR<span style="color: #20b2aa;">)}</span>,
                        EVI             <span style="color: #ff00ff;">=</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED, BLUE<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>G * <span style="color: #20b2aa;">((</span>NIR <span style="color: #ff00ff;">-</span> RED<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">/</span> <span style="color: #20b2aa;">(</span>NIR <span style="color: #ff00ff;">+</span> C<span style="color: #daa520;">1</span> * RED <span style="color: #ff00ff;">-</span> C<span style="color: #daa520;">2</span> * BLUE <span style="color: #ff00ff;">+</span> L<span style="color: #20b2aa;">))}</span>
        <span style="color: #20b2aa;">)</span>


        args <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">lapply</span><span style="color: #20b2aa;">(</span>indices, <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>index<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                                need <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">formals</span><span style="color: #20b2aa;">(</span>INDICES<span style="color: #20b2aa;">[[</span>index<span style="color: #20b2aa;">]]))</span>        
                                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">any</span><span style="color: #20b2aa;">(</span>!need <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>bands<span style="color: #20b2aa;">)))</span> <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span>Band <span style="color: #ff6347;">specification</span><span style="color: #20b2aa;">(</span>s<span style="color: #20b2aa;">)</span> of <span style="color: #ff00ff;">&gt;&gt;</span> , <span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>bands<span style="color: #20b2aa;">)[</span>!<span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>bands<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">%</span><span style="color: #00ffff;">in</span><span style="color: #ff00ff;">%</span> need<span style="color: #20b2aa;">]</span>, collapse <span style="color: #ff00ff;">=</span> ,<span style="color: #20b2aa;">)</span>, 
                                                         <span style="color: #ff00ff;">&lt;&lt;</span> are missing or do not match layer names <span style="color: #00ffff;">in</span> the brick<span style="color: #ff00ff;">/</span>stack. \nPlease specify the correct layer number or name <span style="color: #00ffff;">in</span> a list, e.g. bands <span style="color: #ff00ff;">=</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>RED <span style="color: #ff00ff;">=</span> <span style="color: #00ff00;">'B</span><span style="color: #daa520;">4</span><span style="color: #00ff00;">'</span>, NIR <span style="color: #ff00ff;">=</span> <span style="color: #00ff00;">'B</span><span style="color: #daa520;">5</span><span style="color: #00ff00;">'</span><span style="color: #20b2aa;">)</span>, call. <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>
                                need <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">unlist</span><span style="color: #20b2aa;">(</span>bands<span style="color: #20b2aa;">[</span>need<span style="color: #20b2aa;">])</span>
                        <span style="color: #20b2aa;">})</span>
        <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>args<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&lt;-</span> indices 


        inList <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">lapply</span><span style="color: #20b2aa;">(</span>indices, <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>index<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>verbose<span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">print</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>Calculating , index<span style="color: #20b2aa;">))</span>
                        m<span style="color: #ff00ff;">&lt;-</span>     <span style="color: #ff6347;">overlay</span><span style="color: #20b2aa;">(</span>inputRaster<span style="color: #20b2aa;">[[</span>args<span style="color: #20b2aa;">[[</span>index<span style="color: #20b2aa;">]]]]</span>, fun <span style="color: #ff00ff;">=</span> INDICES<span style="color: #20b2aa;">[[</span>index<span style="color: #20b2aa;">]])</span>
                        <span style="color: #20b2aa;">})</span>


        outStack <span style="color: #ff00ff;">&lt;-</span> <span style="color: #ff6347;">stack</span><span style="color: #20b2aa;">(</span>inList<span style="color: #20b2aa;">)</span>




        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">any</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">grepl</span><span style="color: #20b2aa;">(</span>file, <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>...<span style="color: #20b2aa;">)))))</span> outStack <span style="color: #ff00ff;">&lt;-</span>  <span style="color: #ff6347;">writeRaster</span><span style="color: #20b2aa;">(</span>outStack, ...<span style="color: #20b2aa;">)</span>

        <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>outStack<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">&lt;-</span> indices       
        <span style="color: #00ffff;">return</span><span style="color: #20b2aa;">(</span>outStack<span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
