Org/RStoolbox_0.01_(2014-5-6_by_).org
* superClass.R
#+BEGIN_SRC R 
superClass <- function(inputRaster, trainingData, classAttributes = NULL, nSamples = 100, filename = NULL, maskRaster = NULL, verbose = FALSE, predict = TRUE, overwrite = TRUE, ...) {
	
	
	
	
	
	
	
	
	
	if(!inherits(inputRaster, Raster)) stop(inputRaster must be a raster object (RasterLayer,RasterBrick or RasterStack), call.=FALSE)
	if(!inherits(trainingData, SpatialPolygonsDataFrame)) stop(traingData must be a SpatialPolygonsDataFrame, call.=FALSE)
	
	
	if(is.null(classAttributes)){
		if(ncol(trainingData) == 1) {
			classAttributes <- 1
			message(You did not specify the classAttributes column. \nSince your trainingData only contains one column we assume this is it)
		} else {
			stop(paste(Dont't know which column in trainingData contains the class attribute. \nPlease specify classAttributes as one of: , paste(colnames(trainingData@data),collapse=, )), call. = FALSE)
		}
	} 
	if(!classAttributes %in% colnames(trainingData@data)) 
		stop(paste0(The column , classAttributes,  does not exist in trainingData. \nAvailable columns are: , colnames(trainingData@data,collapse=, )), call. = FALSE) 
		
	
	if(!compareCRS(inputRaster, trainingData)) 
		stop(Projection of trainingData does not match inputRaster)
		
	
	
	if(!gIntersects(as(extent(inputRaster),SpatialPolygons), as(extent(trainingData),SpatialPolygons))) 
		stop(inputRaster and trainingData do not overlap)
	
	
	
	if(is.projected(trainingData)){
		trainingData[[area]] <- gArea(trainingData, byid = TRUE)
	} else {
		trainingData[[area]] <- areaPolygon(trainingData)		
	}
	
	
	trainingData@data[[order]] <- 1:nrow(trainingData) 		
	weights <- ddply(trainingData@data, .variables = classAttributes, .fun = here(mutate), nSamplesClass = ceiling(nSamples * area / sum(area)))
	trainingData@data <- weights[order(weights$order),]
		
	
	xy  <- lapply(seq_along(trainingData), function(i_poly){	
				pts <- spsample(trainingData[i_poly, ], type = random, n = trainingData@data[i_poly,nSamplesClass], iter = 20) 
			})
	xy <- do.call(rbind, xy)
	
	
	if(verbose) {
		plot(inputRaster,1)
		plot(trainingData, add = T)
		points(xy, pch = 3, cex = 0.5)
	}	
	
	
	if(verbose) print(Begin extract)
	dataSet <- data.frame(
			response = as.factor(over(x = xy, y = trainingData)[[classAttributes]]),
			extract(inputRaster, xy, cellnumbers = TRUE))
	
	
	dataSet <- dataSet[!duplicated(dataSet[,cells]),]
	dataSet <- dataSet[,colnames(dataSet) != cells]
	
	
	classes <- unique(trainingData[[classAttributes]])
	classMapping <- data.frame(classID = as.numeric(classes), class = levels(classes))
	
	
	if(verbose) print(Starting to calculate random forest model) 
	model <- randomForest(response ~ . , data = dataSet, na.action = na.omit, confusion = TRUE, ...)		
	
	
	progress <- none
	if(verbose) { print(Starting spatial predict)
		progress <- text
	}
	 
	
	ifelse(length(classes) < 255, dataType <- INT1U,  dataType <- INT2U)
	
	if(is.null(filename)){
		spatPred <- predict(inputRaster, model, progress = progress, dataType = dataType, overwrite = overwrite)
	} else {
		spatPred <- predict(inputRaster, model, filename = filename, progress = progress, dataType = dataType, overwrite = overwrite)
	}
	 
	
	if(verbose)
		print(paste0(paste0(rep(*,20), collapse = ), Classification summary  ,paste0(rep(*,20), collapse = )))
		
		
		print(model)
	
	
	
	return(list(model = model, map = spatPred, classMapping = classMapping)) 
	
}
#+END_SRC
