Org/RStoolbox_0.01_(2014-5-6_by_).html
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> superClass.R</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #ff6347;">superClass</span> <span style="color: #ff00ff;">&lt;-</span> <span style="color: #00ffff;">function</span><span style="color: #20b2aa;">(</span>inputRaster, trainingData, classAttributes <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">NULL</span>, nSamples <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">100</span>, filename <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">NULL</span>, maskRaster <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">NULL</span>, verbose <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">FALSE</span>, predict <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span>, overwrite <span style="color: #ff00ff;">=</span> <span style="color: #daa520;">TRUE</span>, ...<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>









        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>!<span style="color: #ff6347;">inherits</span><span style="color: #20b2aa;">(</span>inputRaster, Raster<span style="color: #20b2aa;">))</span> <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span>inputRaster must be a raster <span style="color: #ff6347;">object</span> <span style="color: #20b2aa;">(</span>RasterLayer,RasterBrick or RasterStack<span style="color: #20b2aa;">)</span>, call.<span style="color: #ff00ff;">=</span><span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>
        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span>!<span style="color: #ff6347;">inherits</span><span style="color: #20b2aa;">(</span>trainingData, SpatialPolygonsDataFrame<span style="color: #20b2aa;">))</span> <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span>traingData must be a SpatialPolygonsDataFrame, call.<span style="color: #ff00ff;">=</span><span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>


        <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.null</span><span style="color: #20b2aa;">(</span>classAttributes<span style="color: #20b2aa;">)){</span>
                <span style="color: #00ffff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">ncol</span><span style="color: #20b2aa;">(</span>trainingData<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">==</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                        classAttributes <span style="color: #ff00ff;">&lt;-</span> <span style="color: #daa520;">1</span>
                        <span style="color: #00ffff;">message</span><span style="color: #20b2aa;">(</span>You did not specify the classAttributes column. \nSince your trainingData only contains one column we assume this is it<span style="color: #20b2aa;">)</span>
                <span style="color: #20b2aa;">}</span> <span style="color: #00ffff;">else</span> <span style="color: #20b2aa;">{</span>
                        <span style="color: #00ffff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span>Dont<span style="color: #00ff00;">'t know which column in trainingData contains the class attribute. \nPlease specify classAttributes as one of: , paste(colnames(trainingData@data),collapse=, )), call. = FALSE)</span>
<span style="color: #00ff00;">                }</span>
<span style="color: #00ff00;">        } </span>
<span style="color: #00ff00;">        if(!classAttributes %in% colnames(trainingData@data)) </span>
<span style="color: #00ff00;">                stop(paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(The column , classAttributes,  does not exist in trainingData. \nAvailable columns are: , colnames(trainingData@data,collapse=, )), call. = FALSE) </span>


<span style="color: #00ff00;">        if(!compareCRS(inputRaster, trainingData)) </span>
<span style="color: #00ff00;">                stop(Projection of trainingData does not match inputRaster)</span>



<span style="color: #00ff00;">        if(!gIntersects(as(extent(inputRaster),SpatialPolygons), as(extent(trainingData),SpatialPolygons))) </span>
<span style="color: #00ff00;">                stop(inputRaster and trainingData do not overlap)</span>



<span style="color: #00ff00;">        if(is.projected(trainingData)){</span>
<span style="color: #00ff00;">                trainingData[[area]] &lt;- gArea(trainingData, byid = TRUE)</span>
<span style="color: #00ff00;">        } else {</span>
<span style="color: #00ff00;">                trainingData[[area]] &lt;- areaPolygon(trainingData)               </span>
<span style="color: #00ff00;">        }</span>


<span style="color: #00ff00;">        trainingData@data[[order]] &lt;- </span><span style="color: #daa520;">1</span><span style="color: #00ff00;">:nrow(trainingData)              </span>
<span style="color: #00ff00;">        weights &lt;- ddply(trainingData@data, .variables = classAttributes, .fun = here(mutate), nSamplesClass = ceiling(nSamples * area / sum(area)))</span>
<span style="color: #00ff00;">        trainingData@data &lt;- weights[order(weights$order),]</span>


<span style="color: #00ff00;">        xy  &lt;- lapply(seq_along(trainingData), function(i_poly){        </span>
<span style="color: #00ff00;">                                pts &lt;- spsample(trainingData[i_poly, ], type = random, n = trainingData@data[i_poly,nSamplesClass], iter = </span><span style="color: #daa520;">20</span><span style="color: #00ff00;">) </span>
<span style="color: #00ff00;">                        })</span>
<span style="color: #00ff00;">        xy &lt;- do.call(rbind, xy)</span>


<span style="color: #00ff00;">        if(verbose) {</span>
<span style="color: #00ff00;">                plot(inputRaster,</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">)</span>
<span style="color: #00ff00;">                plot(trainingData, add = T)</span>
<span style="color: #00ff00;">                points(xy, pch = </span><span style="color: #daa520;">3</span><span style="color: #00ff00;">, cex = </span><span style="color: #daa520;">0</span><span style="color: #00ff00;">.</span><span style="color: #daa520;">5</span><span style="color: #00ff00;">)</span>
<span style="color: #00ff00;">        }       </span>


<span style="color: #00ff00;">        if(verbose) print(Begin extract)</span>
<span style="color: #00ff00;">        dataSet &lt;- data.frame(</span>
<span style="color: #00ff00;">                        response = as.factor(over(x = xy, y = trainingData)[[classAttributes]]),</span>
<span style="color: #00ff00;">                        extract(inputRaster, xy, cellnumbers = TRUE))</span>


<span style="color: #00ff00;">        dataSet &lt;- dataSet[!duplicated(dataSet[,cells]),]</span>
<span style="color: #00ff00;">        dataSet &lt;- dataSet[,colnames(dataSet) != cells]</span>


<span style="color: #00ff00;">        classes &lt;- unique(trainingData[[classAttributes]])</span>
<span style="color: #00ff00;">        classMapping &lt;- data.frame(classID = as.numeric(classes), class = levels(classes))</span>


<span style="color: #00ff00;">        if(verbose) print(Starting to calculate random forest model) </span>
<span style="color: #00ff00;">        model &lt;- randomForest(response ~ . , data = dataSet, na.action = na.omit, confusion = TRUE, ...)                </span>


<span style="color: #00ff00;">        progress &lt;- none</span>
<span style="color: #00ff00;">        if(verbose) { print(Starting spatial predict)</span>
<span style="color: #00ff00;">                progress &lt;- text</span>
<span style="color: #00ff00;">        }</span>


<span style="color: #00ff00;">        ifelse(length(classes) &lt; </span><span style="color: #daa520;">255</span><span style="color: #00ff00;">, dataType &lt;- INT</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">U,  dataType &lt;- INT</span><span style="color: #daa520;">2</span><span style="color: #00ff00;">U)</span>

<span style="color: #00ff00;">        if(is.null(filename)){</span>
<span style="color: #00ff00;">                spatPred &lt;- predict(inputRaster, model, progress = progress, dataType = dataType, overwrite = overwrite)</span>
<span style="color: #00ff00;">        } else {</span>
<span style="color: #00ff00;">                spatPred &lt;- predict(inputRaster, model, filename = filename, progress = progress, dataType = dataType, overwrite = overwrite)</span>
<span style="color: #00ff00;">        }</span>


<span style="color: #00ff00;">        if(verbose)</span>
<span style="color: #00ff00;">                print(paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(rep(*,</span><span style="color: #daa520;">20</span><span style="color: #00ff00;">), collapse = ), Classification summary  ,paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(rep(*,</span><span style="color: #daa520;">20</span><span style="color: #00ff00;">), collapse = )))</span>


<span style="color: #00ff00;">                print(model)</span>



<span style="color: #00ff00;">        return(list(model = model, map = spatPred, classMapping = classMapping)) </span>

<span style="color: #00ff00;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: tian</p>
<p class="date">Created: 2014-09-15 Mon 16:35</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.7c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
